<a href="https://colab.research.google.com/github/cnyakundi/data_science_project_1/blob/master/TuesdaySQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%load_ext sql 

%sql sqlite://

'Connected: @None'

In [ ]:
%load_ext sql 

%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @None'

In [ ]:
import csv 

import pandas as pd

In [ ]:
with open('lighting_dataset.csv','r') as f:
    LightingDataset = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS LightingDataset;
%sql PERSIST LightingDataset;
%sql SELECT * FROM LightingDataset LIMIT 5;

In [ ]:
with open('energy_mining_dataset.csv','r') as f:
    Energy_Mining = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS Energy_Mining;
%sql PERSIST Energy_Mining;

 * sqlite://
Done.
 * sqlite://

'Persisted energy_mining'

In [ ]:
with open('government_appointments.csv','r') as f:
    Appointments = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS Appointments;
%sql PERSIST Appointments;

 * sqlite://
Done.
 * sqlite://

'Persisted appointments'

In [ ]:
with open('marathon_results_2016.csv','r') as f:
    Marathon = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS Marathon;
%sql PERSIST Marathon;

 * sqlite://
Done.
 * sqlite://

'Persisted marathon'

In [ ]:
with open('population_by_district.csv','r') as f:
    Population = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS Population;
%sql PERSIST Population;

 * sqlite://
Done.
 * sqlite://

'Persisted population'

In [ ]:
with open('tea_production.csv','r') as f:
    Tea_Production = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS Tea_Production;
%sql PERSIST Tea_Production;

 * sqlite://
Done.
 * sqlite://

'Persisted tea_production'

In [ ]:
with open('visitors_to_kenya.csv','r') as f:
    Visitors = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS Visitors;
%sql PERSIST Visitors;

 * sqlite://
Done.
 * sqlite://

'Persisted visitors'

In [ ]:
%%sql 

SELECT *,  WARD ||   "," ||COUNTY AS Region

FROM Energy_Mining;

In [ ]:
%%sql 
SELECT PROJECT_NAME, REPLACE("STATUS", '100 % Complete', '100%') AS "Project Status"
FROM Energy_Mining;

In [ ]:
# Example 3
# Using the Population by District dataset,
# we change values of County column to lowercase 
# as shown below
%%sql
SELECT *, LOWER(County) AS Lowered_Population
FROM Population;

In [ ]:
# Challenge 1
# Using the Governments appointments dataset, 
# in gender field, let's replace m = 1 and f = 0
%%sql
SELECT *, REPlACE("Gender", 'm', 1 ) OR REPLACE("Gender", 'f',0) as Replaced_gender
FROM appointments;

In [ ]:
# Challenge 2
# Using the Governments appointments dataset, 
# Let's merge the person appointing field with the appointers position field
#

%%sql
SELECT *, Persons_Appointed_ || ' ,' || Position_ AS Person_Appointed_AND_Position
FROM Appointments
LIMIT 5;

In [ ]:
# Challenge 3
# Using the Population by District dataset, 
# let's change the values of the District column to lowercase 
# and display these values in a new column 

%%sql
SELECT *, LOWER(District) as District_In_Lower_Case
From Population
LIMIT 5;

In [ ]:
# Example 1
# You can work with time data just like any other kind of data type 
# when it is in the time format; HH:MM:SS
# Let's answer some questions to see how this works
# Question: Which athletes took time between 15.30 and 15.59 to pass the 5K mark?
# NB: We order the results

%%sql
SELECT Name, "5K"
FROM Marathon

WHERE "5K" > '0:15:30' AND "5K" < '0:15:59'

ORDER BY "5K" ASC;

In [ ]:

# Finding the minimum amount of time taken to cover 15K by an athlete during the marathon. 
# Hint: We use a where clause to ignore null/blank values - we will learn how to 
# deal with such values later in the course


%%sql
SELECT MIN("5K")
FROM Marathon 
WHERE "5K" >0;

In [ ]:
# What was the average time covered by all athletes past the 10K mark?
%%sql
SELECT time(AVG("10k"))

FROM Marathon;

In [ ]:
# Challenge 1
# What were the names and time of the athletes who 
#finished the marathon before 2hrs 15min official time?
# NB: Order your names by time in ascending order

%%sql 

SELECT Name, "Official Time" AS "Less than hours needed"

FROM Marathon 

WHERE "Official Time" < '2:15:00'

ORDER BY Name DESC

LIMIT 5;

In [ ]:
# Which countries came top 3 in completing the marathon before 2hrs 15min?

%%sql
SELECT Country

FROM Marathon 

WHERE "Official Time" < '2:15:00' 

ORDER BY Country  ASC

LIMIT 3;

In [ ]:
# How many athletes ran 30K under 1hr 34min? Name these athletes.

%%sql 

SELECT Name, "30K"

FROM Marathon 

WHERE "30K" < '1:34:00'

ORDER BY "30K";

In [ ]:
%%sql
SELECT substr('SQL Tutorial', 1, 6) AS ExtractString;

In [ ]:
# 03/31/2005 12:00:00 AM
%%sql
SELECT substr("Date_End_of_Quater",7,4 )
|| '-' || substr("Date_End_of_Quater", 4,2)
|| '-' || substr("Date_End_of_Quater",1,2)
|| '-' || substr("Date_End_of_Quater",12,9)
AS New_FormartedTable
FROM Visitors;

In [100]:
%%sql 

UPDATE Visitors 

SET "Date_End_of_Quater"= substr("Date_End_of_Quater",7,4 )
|| '-' || substr("Date_End_of_Quater", 4,2)
|| '-' || substr("Date_End_of_Quater",1,2)
|| '-' || substr("Date_End_of_Quater",12,9)

 * sqlite://
832 rows affected.

[]

In [101]:
%%sql
SELECT * 
FROM Visitors Limit 5;

 * sqlite://
Done.

[('Arrivals', '2005-31-03-12:00:00 ', '2005', 264600, 'Visitors on Holiday', 'Q1', 'Actual', 0),
 ('Arrivals', '1991-30-06-12:00:00 ', '1991', 149400, 'Visitors on Holiday', 'Q2', 'Actual', 1),
 ('Arrivals', '1991-30-09-12:00:00 ', '1991', 215900, 'Visitors on Holiday', 'Q3', 'Actual', 2),
 ('Arrivals', '1991-31-12-12:00:00 ', '1991', 158400, 'Visitors on Holiday', 'Q4', 'Actual', 3),
 ('Arrivals', '1992-31-03-12:00:00 ', '1992', 155400, 'Visitors on Holiday', 'Q1', 'Actual', 4)]

In [ ]:
%%sql 

SELECT * 

FROM Visitors 

WHERE "Date_End_of_Quater" < '1991-30-9';

In [120]:
%%sql 

SELECT *

FROM Visitors 

WHERE "Arrival_or_Daparture" > '2000-06-30' AND "Arrival_or_Daparture" ='Arrivals' ;

 * sqlite://
Done.

[]

In [126]:
# Using the tea_production dataset, which three dates had tea production 
# before the date with the most tea production?

%%sql 

SELECT Date,  MAX("Millions_in_KGS")

FROM Tea_Production

GROUP BY Date

LIMIT 3;

 * sqlite://
Done.

[('01/25/2003 12:00:00 AM', 'Millions_in_KGS'),
 ('01/25/2004 12:00:00 AM', 'Millions_in_KGS'),
 ('01/25/2005 12:00:00 AM', 'Millions_in_KGS')]